Model: "sequential_6"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_6 (Conv1D)            (None, 16, 128)           768       
_________________________________________________________________
lstm_6 (LSTM)                (None, 512)               1312768   
_________________________________________________________________
dense_18 (Dense)             (None, 128)               65664     
_________________________________________________________________
dense_19 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_20 (Dense)             (None, 20)                1300      
=================================================================
Total params: 1,388,756
Trainable params: 1,388,756
Non-trainable params: 0
_________________________________________________________________
