Model: "sequential_5"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d_5 (Conv1D)            (None, 16, 128)           768       
_________________________________________________________________
lstm_5 (LSTM)                (None, 512)               1312768   
_________________________________________________________________
dense_15 (Dense)             (None, 128)               65664     
_________________________________________________________________
dense_16 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_17 (Dense)             (None, 20)                1300      
=================================================================
Total params: 1,388,756
Trainable params: 1,388,756
Non-trainable params: 0
_________________________________________________________________
