Model: "functional_13"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_7 (InputLayer)         [(None, 5, 1)]            0         
_________________________________________________________________
lstm_6 (LSTM)                (None, 256)               264192    
_________________________________________________________________
dense_18 (Dense)             (None, 128)               32896     
_________________________________________________________________
dense_19 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_20 (Dense)             (None, 20)                1300      
=================================================================
Total params: 306,644
Trainable params: 306,644
Non-trainable params: 0
_________________________________________________________________
