Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 6, 128)            768       
_________________________________________________________________
lstm (LSTM)                  (None, 256)               394240    
_________________________________________________________________
dense (Dense)                (None, 20)                5140      
=================================================================
Total params: 400,148
Trainable params: 400,148
Non-trainable params: 0
_________________________________________________________________
