Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv1d (Conv1D)              (None, 1, 128)            512       
_________________________________________________________________
lstm (LSTM)                  (None, 256)               394240    
_________________________________________________________________
dense (Dense)                (None, 20)                5140      
=================================================================
Total params: 399,892
Trainable params: 399,892
Non-trainable params: 0
_________________________________________________________________
