Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 5, 1)]            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 256)               133120    
_________________________________________________________________
dense (Dense)                (None, 128)               32896     
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_2 (Dense)              (None, 20)                1300      
=================================================================
Total params: 175,572
Trainable params: 175,572
Non-trainable params: 0
_________________________________________________________________
