Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 5, 1)]            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 512)               528384    
_________________________________________________________________
dense (Dense)                (None, 256)               131328    
_________________________________________________________________
dense_1 (Dense)              (None, 128)               32896     
_________________________________________________________________
dense_2 (Dense)              (None, 20)                2580      
=================================================================
Total params: 695,188
Trainable params: 695,188
Non-trainable params: 0
_________________________________________________________________
