Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 5, 1)]            0         
_________________________________________________________________
bidirectional (Bidirectional (None, 512)               528384    
_________________________________________________________________
dense (Dense)                (None, 64)                32832     
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 20)                660       
=================================================================
Total params: 563,956
Trainable params: 563,956
Non-trainable params: 0
_________________________________________________________________
