Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 10, 1)]           0         
_________________________________________________________________
bidirectional (Bidirectional (None, 512)               528384    
_________________________________________________________________
dense (Dense)                (None, 128)               65664     
_________________________________________________________________
dense_1 (Dense)              (None, 64)                8256      
_________________________________________________________________
dense_2 (Dense)              (None, 20)                1300      
=================================================================
Total params: 603,604
Trainable params: 603,604
Non-trainable params: 0
_________________________________________________________________
