Model: "functional_7"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         [(None, 5, 1)]            0         
_________________________________________________________________
bidirectional_1 (Bidirection (None, 512)               528384    
_________________________________________________________________
dense_9 (Dense)              (None, 128)               65664     
_________________________________________________________________
dense_10 (Dense)             (None, 64)                8256      
_________________________________________________________________
dense_11 (Dense)             (None, 20)                1300      
=================================================================
Total params: 603,604
Trainable params: 603,604
Non-trainable params: 0
_________________________________________________________________
